# БАЗА ЗНАНИЙ ДЛЯ ПОДБОРА РАБОТ
 
 
KNOWLEDGE_BASE = {
    
   
    'IfcWall': {
        'keywords_for_search': [

        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная тяжелого бетона БСТ на гранитном щебне',
                      'Арматурные заготовки (стержни, хомуты и т.п.), не собранные в каркасы или сетки',
                      'уход за бетоном',
                      'бетонирование по схеме "кран-бадья"',
                      'монтаж опалубки',
                    'демонтаж опалубки',
                    'установка арматурных изделий',
                    'приготовление бетона',
                    'установка закладных деталей',
                    ]
        }
    },
    
   
    'IfcSlab': {
        'keywords_for_search': [
\
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная',
                      'уход за бетоном',
                      'бетонирование',
                        'монтаж опалубки',
                        'демонтаж опалубки',
                        'установка арматурных изделий',
                        'установка закладных деталей',
                        'арматурные заготовки']
        }
    },
    
   
    'IfcColumn': {
        'keywords_for_search': [

        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная',
                      'уход за бетоном',
                      'монтаж опалубки колонн',
                      'демонтаж опалубки колонн',
                      'бетонирование колонн',
                      'распалубка колонн',
                      'установка закладных деталей',
                      'установка арматурных изделий'
                      ]
        }
    },
    
    
    'IfcBeam': {
        'keywords_for_search': [
            'опалубка балок',
            'арматура балок',
            'бетонирование балок',
            'уход за бетоном балок',
            'распалубка балок'
        ]
    },
    
    
    'IfcRoof': {
        'keywords_for_search': [
            'кровельные работы',
            'гидроизоляция кровли',
            'пароизоляция кровли',
            'утепление кровли',
            'монтаж кровли'
        ]
    },

    'IfcPile': {
        'keywords_for_search': [
            'погружение свай',
            'испытание свай'
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная',
                      'уход за бетоном',]
        }

    },
    
    
    'IfcStair': {
        'keywords_for_search': [
            'монтаж лестницы',
            'бетонирование лестницы',
            'установка ограждений'
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная (ДОЛЖНА БЫТЬ ОБЯЗАТЕЛЬНО)',
                      'уход за бетоном']
        }
    },
    
   
    'IfcFooting': {
        'keywords_for_search': [
            'бетонирование фундамента',
            'уход за бетоном фундамента',
            'гидроизоляция фундамента',
            'утепление фундамента',
            'армирование фундамента'
        ]
    },
    
   
   
    'IfcWindow': {
        'keywords_for_search': [
            'монтаж окон',
            'установка подоконника',
            'герметизация швов'
        ]
    },
    
    
    'IfcDoor': {
        'keywords_for_search': [
            'монтаж дверей',
            'установка коробки',
            'установка фурнитуры'
        ]
    }
}
