# БАЗА ЗНАНИЙ ДЛЯ ПОДБОРА РАБОТ
 
 
KNOWLEDGE_BASE = {
    
   
    'IfcWall': {
        'keywords_for_search': [
            'монтаж опалубки стен',
            'демонтаж опалубки стен',
            'бетонирование по схеме стен'

        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная тяжелого бетона БСТ на гранитном щебне (ДОЛЖНА БЫТЬ ОБЯЗАТЕЛЬНО)',
                      'уход за бетоном']
        }
    },
    
   
    'IfcSlab': {
        'keywords_for_search': [
            'монтаж опалубки перекрытия',
            'демонтаж опалубки перекрытия',
            'арматура перекрытия',
            'бетонирование перекрытия',
            'распалубка перекрытия',
            'монтаж опалубки фундаментных плит',
            'демонтаж опалубки фундаментных плит'
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная тяжелого бетона БСТ на гранитном щебне (ДОЛЖНА БЫТЬ ОБЯЗАТЕЛЬНО)',
                      'уход за бетоном']
        }
    },
    
   
    'IfcColumn': {
        'keywords_for_search': [
            'монтаж опалубки колонн',
            'демонтаж опалубки колонн',
            'арматура колонн',
            'бетонирование колонн',
            'распалубка колонн'
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная  (ДОЛЖНА БЫТЬ ОБЯЗАТЕЛЬНО)',
                      'уход за бетоном']
        }
    },
    
    
    'IfcBeam': {
        'keywords_for_search': [
            'опалубка балок',
            'арматура балок',
            'бетонирование балок',
            'уход за бетоном балок',
            'распалубка балок'
        ]
    },
    
    
    'IfcRoof': {
        'keywords_for_search': [
            'кровельные работы',
            'гидроизоляция кровли',
            'пароизоляция кровли',
            'утепление кровли',
            'монтаж кровли'
        ]
    },

    'IfcPile': {
        'keywords_for_search': [
            'погружение свай'
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная тяжелого бетона БСТ на гранитном щебне (ДОЛЖНА БЫТЬ ОБЯЗАТЕЛЬНО)',
                      'уход за бетоном']
        }

    },
    
    
    'IfcStair': {
        'keywords_for_search': [
            'монтаж лестницы',
            'бетонирование лестницы',
            'установка ограждений'
        ],
        'material_key_words': {
            'бетон': ['Смесь бетонная (ДОЛЖНА БЫТЬ ОБЯЗАТЕЛЬНО)',
                      'уход за бетоном']
        }
    },
    
   
    'IfcFooting': {
        'keywords_for_search': [
            'бетонирование фундамента',
            'уход за бетоном фундамента',
            'гидроизоляция фундамента',
            'утепление фундамента',
            'армирование фундамента'
        ]
    },
    
   
   
    'IfcWindow': {
        'keywords_for_search': [
            'монтаж окон',
            'установка подоконника',
            'герметизация швов'
        ]
    },
    
    
    'IfcDoor': {
        'keywords_for_search': [
            'монтаж дверей',
            'установка коробки',
            'установка фурнитуры'
        ]
    }
}
